package com.example.graduateproject.schedule.lessons.fake

import com.example.graduateproject.schedule.model.Lesson

object FakeLessons {
    val list = arrayListOf(
        Lesson(
            0, 0, 1, "пн", "тест", 1, "212", 1, "8:30", "9:00"
        ),
        Lesson(
            1, 1, 2, "вт", "тест", 0, "а15", 1, "7:30", "9:00"
        ),
        Lesson(
            2, 2, 2, "ср", "тест", 1, "212", 1, "10:30", "14:00"
        ),
        Lesson(
            3, 3, 4, "чт", "тест", 1, "а25", 1, "12:30", "15:00"
        ),
        Lesson(
            4, 4, 6, "пт", "тест", 0, "а17", 1, "18:30", "21:00"
        ),
        Lesson(
            5, 5, 8, "сб", "тест", 1, "111", 1, "18:30", "19:00"
        ),

        Lesson(
            6, 0, 3, "пн", "тест", 1, "112", 2, "8:30", "9:00"
        ),
        Lesson(
            7, 1, 2, "вт", "тест", 1, "а25", 2, "7:30", "9:00"
        ),
        Lesson(
            8, 2, 4, "ср", "тест", 0, "333", 2, "10:30", "14:00"
        ),
        Lesson(
            9, 3, 5, "чт", "тест", 0, "а25", 2, "12:30", "15:00"
        ),
        Lesson(
            10, 4, 6, "пт", "тест", 0, "444", 2, "18:30", "21:00"
        ),
        Lesson(
            11, 5, 7, "сб", "тест", 1, "111", 2, "18:30", "19:00"
        )
    )
}